intro = '''Привет! Я готова предложить тебе три словесные игры. Первая - «Тройная чепуха», вторая - «Запрещённая 
буква», третья - «Аббревиатура». Выбери одну из предложенных или я могу рассказать правила каждой. Если понадобится 
помощь, то скажи : "Алиса, помощь". Если хочешь выйти, скажи: "Алиса, стоп".  Если услышал незнакомое слово, 
скажи: "Алиса, что значит это слово?" '''

rules = '''Правила игры «Тройная чепуха». Один из игроков называет любую букву. Другой должен сказать фразу, 
где все три слова начинаются с этой буквы. Так играем по очереди. Правила игры «Запрещённая буква». Водящий задаёт 
игрокам вопросы, на которые надо давать быстрые ответы, но избегая определённую букву (игроки заранее оговаривают, 
какая это будет буква). Ход по очереди. Правила игры «Аббревиатура». Один игрок называет слово, другой придумывает 
предложение, которое состоит из слов, каждое из которых начинается с буквы предложенного слова. Звучит сложно, 
но на примере сразу станет понятно. Пример: Загадали слово «рука» – Резвая Утка Крякнула Аптекарю. Ход по очереди. 
Выберите одну из игр. '''

abr_rules = '''Правила игры «Запрещённая буква». Водящий задаёт игрокам вопросы, на которые надо давать быстрые 
ответы, но избегая определённую букву (игроки заранее оговаривают, какая это будет буква). Ход по очереди. Начнём? '''

zapr_rules = '''Правила игры «Запрещённая буква». Водящий задаёт игрокам вопросы, на которые надо давать 
быстрые ответы, но избегая определённую букву (игроки заранее оговаривают, какая это будет буква). Ход по очереди. 
Начнём? '''

troynaya_rules = '''Правила игры «Тройная чепуха». Один из игроков называет любую букву. Другой должен сказать 
фразу, где все три слова начинаются с этой буквы. Так играем по очереди. Начнём? '''

exit_phrases = ['exit', 'quit']

agree = ['да', 'конечно', 'я согласен', 'давай', 'хорошо', 'я за', ]

disagree = ['нет', 'не хочу', 'давай не будем', 'давай нет', 'не надо', 'не нужно', 'я против']

forb_let_questions = ['Первый вопрос. Как у вас дела?', 'Второй вопрос. Какая погода за окном?', 'Третий вопрос. Что вы ели сегодня на ужин?', 'Четвертый вопрос. Чем вы сегодня занимались?', 'Пятый вопрос. Какое ваше любимое животное?']

alph = ['а', 'б', 'в', 'г', 'д', 'е', 'ё', 'ж', 'з', 'и', 'й', 'к', 'л', 'м', 'н', 'о', 'п', 'р', 'с', 'т', 'у', 'ф', 'х', 'ц', 'ч', 'ш', 'щ', 'ъ', 'ы', 'ь', 'э', 'ю', 'я']