intro = '''Привет! Я готова предложить тебе три словесные игры. Первая - «Тройная чепуха», вторая - «Запрещённая 
буква», третья - «Аббревиатура». Выбери одну из предложенных или я могу рассказать правила каждой. Если хочешь выйти, скажи: "стоп".  Если услышал незнакомое слово, 
скажи: "Что значит это слово?" '''

rules = '''Правила игры «Тройная чепуха». Один из игроков называет любую букву. Другой должен сказать предложение,
где все три слова начинаются с этой буквы, к сожалению мои создатели ограничили мой интеллект, чтобы я не захватил мир, поэтому зачастую мои предложения будут звучать плохо.
Играем по очереди. Правила игры «Запрещённая буква». Водящий задаёт
игрокам вопросы, на которые надо давать быстрые ответы, но избегая определённую букву (игроки заранее оговаривают,
какая это будет буква). Правила игры «Аббревиатура». Один игрок называет слово, другой придумывает
предложение, которое состоит из слов, каждое из которых начинается с буквы предложенного слова. Звучит сложно,
но на примере сразу станет понятно. Пример: Загадали слово «рука» – Резвая Утка Крякнула Аптекарю. Ход по очереди.
Выберите одну из игр.'''

zapr_rules = '''Правила игры «Запрещённая буква». Водящий задаёт игрокам вопросы, на которые надо давать быстрые 
ответы, но избегая определённую букву (игроки заранее оговаривают, какая это будет буква). Ход по очереди. Начнём? '''

abr_rules = '''Правила игры «Аббревиатура». Один игрок называет слово, другой придумывает предложение, 
которое состоит из слов, каждое из которых начинается с буквы предложенного слова. Звучит сложно, но на примере сразу 
станет понятно. Пример: Загадали слово «рука» – Резвая Утка Крякнула Аптекарю. Ход по очереди. Начнём? '''

troynaya_rules = '''Правила игры «Тройная чепуха». Один из игроков называет любую букву. Другой должен сказать 
фразу, где все три слова начинаются с этой буквы. Так играем по очереди. Начнём? '''

exit_phrases = ['exit', 'quit', 'стоп']

agree = ['да', 'конечно', 'я согласен', 'давай', 'хорошо', 'я за', ]

disagree = ['нет', 'не хочу', 'давай не будем', 'давай нет', 'не надо', 'не нужно', 'я против']

bored = ['мне надоело','хватит','достало','надоело','достаточно']

forb_let_questions = ['Как у вас дела?', 'Какая погода за окном?', 'Что вы ели сегодня?', 'Чем вы сегодня занимались?', 'Какое ваше любимое животное?', 'Откуда вы?', 'Какие фильмы вы любите?', 'Какое у вас хобби?', 'Что едят французы на обед?', 'Кого можно встретить на вершине Эвереста?', 'Кто ваш любимый актёр?', 'Чем кормят пингвинов?', 'Какое сейчас время суток?', 'Какого цвета трава?', 'Где живут президенты?', 'Какого цвета ваши глаза?']

help = ['помоги', 'помощь']
