INTRO = 'Привет! Я готов предложить тебе три словесные игры.\nПервая - «Тройная чепуха», вторая - «Запрещённая  буква», третья - «Аббревиатура». Выбери одну из предложенных или я могу рассказать правила каждой. Если хочешь выйти, скажи: "стоп". Если услышал незнакомое слово, скажи: "Что значит" и произнеси это слово'

ALL_rules = 'Правила игры «Тройная чепуха».\nВы загадываете любую букву. По очереди мы должны сказать фразу, где все три слова начинаются с этой буквы.\n\nПравила игры «Запрещённая буква».\nЯ задаю вам вопросы, на которые надо давать быстрые ответы, но избегая определённую букву (мы заранее оговариваем, какая это будет буква). Для этой игры ты можешь позвать друзей и отвечать с ними по очереди, так будет веселее.\n\nПравила игры «Аббревиатура».\nВы называете слово, по очереди мы придумываем предложение, которое состоит из слов, каждое из которых начинается с буквы предложенного слова. Звучит сложно, но на примере сразу станет понятно. Пример: Загадали слово «рука» – Резвая Утка Крякнула Аптекарю.\n\nВо что будем играть?'

ALL_names = ['правила каждой','правила каждой', 'правила всех', 'правила всех игр', 'правила каждой игры', 'правила каждой из игр',
             'правила каждый', 'какие правила у всех']

FORBIDEN_rules = 'Правила игры «Запрещённая буква». Я задаю вам вопросы, на которые надо давать быстрые ответы, но избегая определённую букву (мы заранее оговариваем, какая это будет буква). Можешь позвать друзей и отвечать с ними по очереди, так будет веселее.\nНачнём?'

FORBIDEN_names = ['выбираю запрещенную букву','запрещенную букву','в запрещенную букву', 'выбираю игру запрещенная буква',
                  'выбираю поиграть в запрещенную букву',
                  'выбираю поиграть в игру запрещенная буква', 'выбираю сыграть в запрещенную букву',
                  'выбираю сыграть в игру запрещенная буква', 'давай в запрещенную букву',
                  'давай в игру запрещенная буква',
                  'давай запрещенная буква', 'давай игру запрещенная буква', 'давай поиграем в запрещенную букву',
                  'давай сыграем в запрещенную букву', 'думаю запрещенная буква', 'думаю игра запрещенная буква',
                  'думаю поиграть в запрещенную букву', 'думаю поиграть в игру запрещенная буква',
                  'думаю сыграть в запрещенную букву', 'думаю сыграть в игру запрещенная буква', 'запрещенная буква',
                  'игра запрещенная буква', 'поиграем в запрещенную игру', 'сыграем в запрещенную букву',
                  'хочу запрещенную букву', 'хочу игру запрещенная буква', 'хочу поиграть в запрещенную букву',
                  'хочу сыграть в запрещенную букву', 'я выбираю запрещенную букву', 'я выбираю игру запрещенная буква',
                  'я выбираю поиграть в запрещенную букву', 'я выбираю поиграть в игру запрещенная буква',
                  'я выбираю сыграть в запрещенную букву', 'я выбираю сыграть в игру запрещенная буква',
                  'я хочу запрещенную букву', 'я хочу игру запрещенная буква', 'я хочу поиграть в запрещенную букву',
                  'я хочу сыграть в запрещенную букву', 'я хочу в запрещенную букву', 'я хочу в игру запрещенная буква']

ABBREVIATION_rules = 'Правила игры «Аббревиатура».\nВы называете слово, по очереди мы придумываем предложение, которое состоит из слов, каждое из которых начинается с буквы предложенного слова.\nНачнём?'

ABBREVIATION_names = ['аббревиатура', 'выбираю аббревиатуру','аббревиатуру','в аббревиатуру', 'выбираю игру аббревиатура',
                      'выбираю поиграть в аббревиатуру',
                      'выбираю поиграть в игру аббревиатура', 'выбираю сыграть в аббревиатуру',
                      'выбираю сыграть в игру аббревиатура', 'давай аббревиатура', 'давай в игру аббревиатура',
                      'давай игру аббревиатура', 'давай поиграем в аббревиатуру', 'давай сыграем в аббревиатуру',
                      'думаю аббревиатура', 'думаю игра аббревиатура', 'думаю поиграть в аббревиатуру',
                      'думаю поиграть в игру аббревиатура', 'думаю сыграть в аббревиатуру',
                      'думаю сыграть в игру аббревиатура',
                      'игра аббревиатура', 'поиграем в аббревиатуру', 'сыграем в аббревиатуру', 'хочу аббревиатуру',
                      'хочу игру аббревиатура', 'хочу поиграть в аббревиатуру', 'хочу сыграть в аббревиатуру',
                      'я выбираю аббревиатуру', 'я выбираю игру аббревиатура', 'я выбираю игру аббревиатура',
                      'я выбираю поиграть в аббревиатуру', 'я выбираю поиграть в игру аббревиатура',
                      'я выбираю сыграть в аббревиатуру', 'я выбираю сыграть в игру аббревиатура',
                      'я хочу аббревиатуру',
                      'я хочу игру аббревиатура', 'я хочу поиграть в аббревиатуру', 'я хочу сыграть в аббревиатуру',
                      'я хочу в игру аббревиатура', 'я хочу в аббревиатуру']

TRIPLE_rules = 'Правила игры «Тройная чепуха».\nВы загадываете любую букву. По очереди мы должны сказать фразу, где все три слова начинаются с этой буквы.\nНачнём?'
TRIPLE_names = ['выбираю игру тройная чепуха', 'выбираю поиграть в игру тройная чепуха',
                'выбираю поиграть в тройную чепуху', 'выбираю сыграть в игру тройная чепуха',
                'выбираю сыграть в тройную чепуху', 'выбираю тройную чепуху', 'давай в игру тройная чепуха',
                'давай в тройную чепуху', 'давай игру тройная чепуха', 'давай поиграем в тройную чепуху',
                'давай сыграем в тройную чепуху', 'давай тройная чепуха', 'думаю игра тройная чепуха',
                'думаю поиграть в игру тройная чепуха', 'думаю поиграть в тройную чепуху',
                'думаю сыграть в игру тройная чепуха', 'думаю сыграть в тройную чепуху', 'думаю тройная чепуха',
                'игра тройная чепуха', 'поиграем в тройную чепуху', 'сыграем в тройную чепуху', 'тройная чепуха',
                'хочу игру тройная чепуха', 'хочу поиграть в тройную чепуху', 'хочу сыграть в тройную чепуху',
                'хочу тройную чепуху', 'я выбираю игру тройная чепуха', 'я выбираю поиграть в игру тройная чепуха',
                'я выбираю поиграть в тройную чепуху','в тройную чепуху','тройную чепуху', 'я выбираю сыграть в игру тройная чепуха',
                'я выбираю сыграть в тройную чепуху', 'я выбираю тройную чепуху', 'я хочу игру тройная чепуха',
                'я хочу поиграть в тройную чепуху', 'я хочу сыграть в тройную чепуху', 'я хочу тройную чепуху',
                'я хочу в игру тройная чепуха', 'я хочу в тройную чепуху']

EXIT_phrases = ['exit', 'quit', 'стоп']

FIND_phrases = ['понятие', 'понятие слова', 'что значит', 'что значит слово', 'что значит фраза', 'что обозначает',
                'что обозначает слово', 'что означает', 'что означает слово', 'что такое', 'что такое слово', ]

AGREE = ['да', 'конечно', 'я согласен','я согласна',  'давай', 'хорошо', 'я за', 'окей', 'ок', 'yes', 'yep', 'отлично', 'продолжим',
         'продолжаем', 'ага', 'да давай', 'да хорошо', 'конечно да', 'ну да', 'начнем', 'ладно', 'ладно продолжим']

DISAGREE = ['нет', 'не хочу', 'давай не будем', 'давай нет', 'не надо', 'не нужно', 'я против', 'заканчиваем',
            'закончим', 'no', 'не', 'не продолжим', 'отстань', 'прекрати', 'прервём', 'окончим', 'конец', 'нет не нужно', 'нет не хочу',
            'не стоит', 'нет не стоит', 'нет не надо', 'неа', 'ну нет']

BORED = ['мне надоело', 'хватит', 'достало', 'надоело', 'достаточно', 'скучно']

abilities = ['что ты умеешь', 'какие игры есть', 'все игры', 'во что можно поиграть', 'какие ты знаешь игры', 'какие игры ты знаешь', 'во что можно поиграть с тобой']

FORBIDEN_questions = ['Где живут президенты?', 'Если бы вам осталось жить год, как бы вы его провели?',
                      'Если бы вы должны были проживать один и тот же день снова и снова, какой день в своей жизни вы бы выбрали?',
                      'Если бы вы могли своими глазами увидеть любое событие из прошлого, настоящего или будущего, что бы вы выбрали?',
                      'Если бы вы прославились, то чем вы были бы знамениты?', 'Любишь есть ночью?',
                      'Если бы деньги не были помехой, что бы вы купили?', 'Какие твои главные вредные привычки?',
                      'Если бы список 7 чудес света нужно было составить заново, что бы вы в него включили?',
                      'Если бы ты мог чем-то заняться до конца своих дней, что бы это было?',
                      'Есть вредные привычки? какие?', 'Как у вас дела?', 'О каком своем промахе ты думаешь перед сном?',
                      'Какая общая идея могла бы объединить людей на планете?', 'Какая погода за окном?',
                      'Какие фильмы вы любите?', 'Каким вы видите себя через пять лет?', 'Кем бы ты хотел(а) стать в следующей жизни?',
                      'Какого бы домашнего питомца хотел бы завести?', 'Какого цвета ваши глаза?', 'Если бы тебе осталось жить пару дней, как бы их провел(а)?',
                      'Какого цвета трава?', 'Какое ваше любимое животное?', 'Какое сейчас время суток?',
                      'Какое твоё любимое блюдо?', 'Какое у вас хобби?', 'Что самое странное ты делала на спор?',
                      'Какой вымышленный персонаж вам больше всего нравится?', 'Какой твою любимый жанр музыки?',
                      'Какой язык вы хотите освоить и почему?', 'Какую сверхспособность вам хотелось бы иметь?',
                      'Кого можно встретить на вершине эвереста?', 'Кто ваш любимый актёр?', 'Любовь или деньги?',
                      'Откуда вы?', 'С кем бы ты хотел оказаться на необитаемом острове?', 'Назови несколько любимых женских и мужских имен.',
                      'Тебе дали три желания, что бы ты загадал?', 'Ты любишь читать?', 'Ты разговариваешь с собой в зеркале?',
                      'Хотели бы вы стать бессмертным?', 'Чего вы боитесь больше всего на свете?',
                      'Чем вы сегодня занимались?', 'Чем кормят пингвинов?', 'Когда было стыдно за кого-то другого?',
                      'Вы когда-нибудь были загипнотизированы?', 'Какой самый худший подарок вы когда-либо получали?',
                      'Если бы у вас была машина времени, в какой период вы бы поехали?', 'С кем ты бы ограбил(а) банк?',
                      'Что бы вы предпочли: быть самым богатым человеком в мире или самым умным?',
                      'Если бы вашу жизнь сняли в кино, кто бы вас сыграл?', 'О чем думаешь прямо сейчас?',
                      'Что бы вы предпочли: иметь 3 ноги или 3 руки?', 'Сколько раз вы тайком убегали из дома?',
                      'Что бы вы предпочли: иметь кота в теле собаки или собаку в теле кота?', 'Как проехать к цирку?',
                      'Что бы вы предпочли: не различать никаких вкусов или видеть мир в черно-белом цвете?',
                      'Что бы вы предпочли: стать вампиром или оборотнем?', 'Если бы вы могли жить где угодно в мире, где бы вы жили?',
                      'Что бы вы предпочли: уметь говорить на всех языках мира или уметь разговаривать с животными?',
                      'Что бы вы предпочли: уметь читать чужие мысли или летать?', 'Какими прозвищами тебя награждали в детстве?',
                      'Что бы вы предпочли: хобот, как у слона, или шею, как у жирафа?', 'Люди заблуждаются, считая тебя … ?',
                      'Что бы вы предпочли: читать мысли или видеть сквозь стены?', 'Что вы ели сегодня?', 'Сколько косточек в яблоке?',
                      'Что едят французы на обед?', 'Какой самый мерзкий розыгрыш вы над кем-то разыграли?', 'Какая твоя любимая песня?',
                      'Что именно каждый человек должен хотя бы раз испытать в своей жизни?', 'Что такое сны?',
                      'Что тебя больше всего веселит и смешит?', 'Что ты делаешь, когда ты один?', 'Какие песни поешь под душем?',
                      'Что хуже: потерять зрение или слух?', 'На какой постыдной лжи тебя ловили?', 'Основные причины того, что ты злишься?', ]

HELP = ['помоги', 'помощь', 'не хочу играть', 'мне надоело', 'хватит', 'достало', 'надоело', 'достаточно', 'скучно', ]

intro_sound = '<speaker audio="dialogs-upload/f66c1b12-5d4e-47b8-9b9e-3ff3e9ae385b/88ef0f08-fc0e-439d-9890-1fa80f398227.opus">'
correct_sound = '<speaker audio="dialogs-upload/f66c1b12-5d4e-47b8-9b9e-3ff3e9ae385b/7099d9e7-cb82-48e9-949e-2afb5bdebc4a.opus">'
wrong_sound = '<speaker audio="dialogs-upload/f66c1b12-5d4e-47b8-9b9e-3ff3e9ae385b/ef1ff255-f47c-4405-8183-948a658b368e.opus">'
